org/01procedures.tex
% Created 2023-12-17 Sun 17:27
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Caesar X Insanium}
\date{\today}
\title{Chapter 1: Building Abstractions with Procedures}
\hypersetup{
 pdfauthor={Caesar X Insanium},
 pdftitle={Chapter 1: Building Abstractions with Procedures},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.6.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

Here are the relevant lectures related to this chapter

\begin{itemize}
\item \href{https://www.youtube.com/watch?v=eJeMOEiHv8c}{Lecture 1A}
\end{itemize}
\href{https://www.youtube.com/watch?v=-J\_xL4IGhJA\&list=PLE18841CABEA24090\&index=1}{- Lecture 1B}
\begin{itemize}
\item \href{https://youtu.be/eJeMOEiHv8c?list=PLE18841CABEA24090}{Lecture 2A}
\end{itemize}

A process is an idea of a set of events occurring under the direction of
a program.

Lips was invited as a way to express computational thought in a manner
using recursion equations. Lisp is an interpreted language that is akin
to a mathematical notation. While it used to be slow it became able to
translate directly to machine code in order to get that boost in
performance. It can now be used in production and as an extension
language. In lisp, data and function can be both be returned from
function calls.

\section{1.1 Elements of Programming}
\label{sec:org5c8b2d9}
Programming languages can be used to express ideas about instructions
that we want a computer to execute as well as about processes and
incorporate decision-making. This is composed to 3 things

\begin{itemize}
\item primitive expressions: simplest entities and data
\item combination: methods to build larger things from smaller ones
\item abstractions: ways to reduce complexity by finding implementation
details and organizing data and procedures
\end{itemize}

\subsection{1.1.1 Expressions}
\label{sec:orge950840}
Expressions are evaluated and interpreter will return a value, usually
itself.

Here is an example in lisp

\begin{verbatim}
89 ;; will return 89 as an integers
(+ 9 10) ;; will evaluate result of adding 9 and 10 and then return
(+ 1 1 1 1) ;; unlimited number of operands
(+ (* 3 8) (- 10 4)) ;; nested expressions
\end{verbatim}

Operators and operands are organized into prefix notation where the
operator is listed first and operands come afterwards. This hold true
for function calls. More complicated expressions are difficult for
humans to understand, but an interpreter can easily handle complexity.

Of course such expressions can also be rewritten in a way that would
allow for easier human understanding by aligning operators.

\begin{verbatim}
(+ (* 3
      (+ (* 2 4)
         (+ 3 5)))
   (+ (- 10 7)
      (6))
\end{verbatim}

\subsection{1.1.2 Naming and Environment}
\label{sec:orgc5b7642}
In lisp things can be named with \texttt{define}. This allows easy reference
with a value without spelling it out. Assigned variable names are
evaluated with their referred value.

\begin{verbatim}
(define size 2)
(+ size 2) ;; evaluates to 2
\end{verbatim}

\subsection{1.1.3 Evaluating Combinations}
\label{sec:orgd1d791c}
In order to evaluate lisp expression

\begin{itemize}
\item evaluate sub-expressions
\item apply procedure on data
\item return value
\end{itemize}

Imagine a tree structure that with each expression, there is an operator
and a list of values. They can either be literals or expressions that
themselves need to be evaluated.

\subsection{1.1.4 Compound Procedures}
\label{sec:org923e289}
Abstraction technique that allows for a set of instructions to be saved
and used multiple times in a program.

Here is procedure that square a number.

\begin{verbatim}
(define (square x) (* x x))
;; here is example usage
(square 21)
(square (+ 6 7))
(square (square 5))
\end{verbatim}

Define a procedure where we multiply a thing by itself. Here we use the
\texttt{define} keyword to name a procedure, specify that it takes only one
parameter and then following expression is that happens to data that is
passed.

\begin{verbatim}
(define (<name> <formal parameters>) (<body expression>))
\end{verbatim}

\subsection{1.1.5 Substitution Model Procedure Application}
\label{sec:orgd3b2c6d}
Evaluation begins from the top down, in order to begin to evaluate the
top most expression, first the bottom expressions must be evaluated
recursively. One way is to replace every instance where we call a
procedure with the body of said procedure.

One can simply think back to algebra to when we were solving systems of
equations. This is known as the substitution model.

Full implementation of interpreter and compiler will be done in this
book.

Normal order evaluation is done by humans where full meaning of
expression is expanded to using only the most basic ideas and then
evaluate. Interpreter use application order evaluation where expressions
are evaluated before applying.

\subsection{1.1.6 Conditional Expression and Predicates}
\label{sec:org3825554}
Method for executing different based on results of tests if required for
Turing completeness and is basis for any for decision-making. Here are
some examples.

\begin{verbatim}
(define (abs x)
  (cond ((> x 0) x) ;; this function is very similar to switch statement from C
        ((= x 0) 0)
        ((< x 0) (-x))))
(define (abs x)
  (cond ((< x 0) (-x))
        (else x)))
(define (abs x)
  (if (< x 0)
      (- x)
      x))
\end{verbatim}

Here a condition is defined followed by a list of clauses or tests that
can be performed.

We see the base form for a conditional statement in lisp.

\begin{verbatim}
(if <predicate> <consequent> <alternative>)
\end{verbatim}

\subsubsection{Example: Square Root using Newton's Method}
\label{sec:orgb19a491}
\begin{verbatim}
(define (square x)
    (* x x))

(define (improve guess x)
  (average guess (/ x guess)))

(define (average x y)
  (/ (+ x y) 2))

(define (good-enough? guess x)
    (< (abs (- (square guess) x)) 0.001))

(define (sqrt-iter guess x)
  (if (good-enough? guess x)
    guess
    (sqrt-iter (improve guess x)
                x)))

(define (sqrt x)
  (sqrt-iter 1.0 x))
\end{verbatim}

\subsection{1.1.8 Procedures as Black-Box Abstractions}
\label{sec:orge028c92}
Procedure Abstraction should allow for encapsulation of lower level
procedure and joining them together in order to make larger procedures.
Naming arguments generally does not matter to user of a procedure. All
that matters is that the function is correct and returns needed value.

Lisp also allows defining private procedures inside other procedures in
order to be able to maintain a specific procedure that is important to
working of public facing function.

\begin{verbatim}
(define (public x)
  (define (private y)
    (write y)
    (newline))
  (private x)
\end{verbatim}

\section{1.2 Procedures and Processes They Generate}
\label{sec:orgb0aad1b}
In order to make the best use of procedure it is not enough to know how
they work one must also know tactics and strategies for using them. In
order to get the bast idea on how to design and build a system one must
have a good idea on what we want the end result to be. It makes it
necessary to plan out much of what we want to do. Procedures are local
evolutions of computational processes and as such can be built on top of
each other in order to create the bigger result. They are some "shapes"
that procedure definitions can follow.

Lisp allows reasoning about and build procedures as if they were
mathematical expressions.
