org/01procedures.org
** 1.2.1 Linear Recursion
:PROPERTIES:
:CUSTOM_ID: linear-recursion
:END:
The definition of factorial is as follows

\begin{equation}
n! = n * (n - 1) * (n -2) ...3 * 2 * 1
\end{equation}

From this it is logical to assume that /n/ factorial is equal to /n/
times /n/ minus one factorial.

\begin{equation}
n! = n * (n-1)!
\end{equation}

Here is a more recursive method

#+begin_src scheme
(define (factorial n)
  (if (= n 1)
    1
    (* n
       (factorial (- n -1)))))
#+end_src

Here is another method of defining the factorial function.

#+begin_src scheme
(define (factorial n)
  (define (iter product counter)
    (if (> counter n)
      product
      (iter (* counter product)
            (+ counter 1))))
  (iter 1 1))
#+end_src

Expanding expression allows one to see the true "shape" of a procedure
as it evaluates. Some have a diamond shape as the expression expands to
the simplest term and then contracts as each term is evaluated.

The expansion evaluation of a procedure is known as
=deferred operations= in which an is like as the program is being run
this is the part where each function is being initial called. And then
after that the evaluation of the value is the actual recursion.

With the iterative function definition each time the recursive function
is called it is being immediate evaluated before it can be called again.
This is =iterative= processes. In this method the state can be tracked
with certain variables keeping track of when the process should end if
at all. For is a for loop in most languages.

Iterative procedures allow for easy description of the entire state of
the process at any given point. Recursive not so much since the
compiler/interpreter hide away much of the inner working up to the point
in which it is difficult to resume from any position.

Recursive procedures are strictly those that call themselves within
their own definition. Iterative procedures hold their state in outside
variables.

Most languages define iterative procedures using for/while loop unlike
Scheme and any other lisp dialect.

** 1.2.2 Tree Recursion
:PROPERTIES:
:CUSTOM_ID: tree-recursion
:END:
/Tree recursion/ occurs when a procedure calls itself more than once
inside its own definition. For example look at this procedure for
getting Fibonacci numbers.

#+begin_src scheme
(define (fib n)
  (cond ((= n 0) 0)
        ((= n 1) 1)
        (else (+ (fib (- n 1))
                 (fib (- n 2))))))
#+end_src

This example is not efficient because work is repeated. Computing the
Fibonacci of any sufficiently big number will result with entire
branches of work being recalculate in different branches in the
execution of the procedure. The time complexity of this function is
exponential. Space complexity grow linearly.

Here is iterative version.

#+begin_src scheme
(define (fib_i n)
  (fib-iter 1 0 n))

(define (fib-iter a b counter)
  (if (= counter 0)
    b
    (fib-iter (+ a b) a (- ounter 1))))
#+end_src

Here the time complexity is linear.

Tree recursion and iteration are tools and should be used when it is the
best tool in the current situation.

** 1.2.3 Orders of Growth
:PROPERTIES:
:CUSTOM_ID: orders-of-growth
:END:
Order of growth simply describe who quickly the time it takes for a
procedure to finish executing given data size /n/ as /n/ reaches
infinity. /N/ can be used to describe the size of a number itself, the
number of bit required to describe a piece of data, the number of
elements in a data structure.

Such method of describing a procedure grows in computation time is
inaccurate, but it is useful in describing how efficient an algorithm
really is.

** 1.2.4 Exponentiation
:PROPERTIES:
:CUSTOM_ID: exponentiation
:END:
One way to calculate the exponent of a value is to use the recursive
definition of exponentiation.

\begin{equation}
b^n = b * b^{n-1},
b^0 = 1
\end{equation}

Here it is in scheme.

#+begin_src scheme
(define (expt b n)
  (if (= n 0)
    1
    (* b ( expt b (- n 1)))))
#+end_src

It is possible to make a faster procedure by simply using a different
algorithm. It can be done using the idea that certain value can be
reached faster. For example take following expression.

\begin{equation}
b^4 = b^2 * b^2
\end{equation}

Using this \[ b^8 \] can be calculated much faster. Here is an
implementation.

#+begin_src scheme
(define (fast-expt b n)
  (cond ((= n 0) 1)
        ((even? n) (square (fast-expt b (/ n 2))))
        (else (* b (fast-expt b (- n 1))))))
#+end_src

Given from this implementation, it can be easy to see that the time
complexity goes to logarithmic because each exponent jump is bigger the
deeper the recursion goes.

** 1.2.5 Greatest Common Divisor
:PROPERTIES:
:CUSTOM_ID: greatest-common-divisor
:END:
Greatest Common Divisor or GCD is defined as the largest integers that
divides integers A and B. Meaning that there are integers x and y such
that \[ x *GCD =A \] and \[ y* GCD =  B \]

Finding the GCD is simple since one can take the recursive definition.



\begin{equation}
GCD(a,b) = GCD(b,r)
\end{equation}

Use it to define this function in scheme.

#+begin_src scheme
(define (gdc a b)
  (if (= b 0)
      a (gcd (remainder a b))))
#+end_src

We continuously divide a from b recursively until the final GCD is
found.

This algorithm is iterative in nature as each recursion is a tail
recursion and grows in logarithmic time.

*** Example: Testing for Primality
:PROPERTIES:
:CUSTOM_ID: testing-for-primality
:END:
There are two main methods for testing if integer n is a prime number or
not.

One strategy is to find if it has any factors.

#+begin_src scheme
;;Naive Method

(define (square x) (* x x))

(define (smallest-divisor n)
  (find-divisor n 2))

(define (divides? a b) (= (remainder b a) 0))

(define (find-divisor n test-divisor)
  (cond ((> (square test-divisor) n ) n)
        ((divides? test-divisor n) test-divisor)
        (else (find-divisor n (+ test-divisor 1)))))

(define (prime? n) (= n (smallest-divisor n)))
#+end_src

What this implementation does it check all numbers less than square root
of n if they are the prime numbers. The logic goes if none of those work
then the number /n/ is prime.

The second big strategy is based on Fermat's Little theorem which states
basically the idea that is /n/ is a prime number and /a/ is a positive
integer less than /n/ then /a/ raised to the /n/ power is congruent to
/a/ modulo /n/.

Two numbers are congruent if when divide by the same number have the
same remainder.

#+begin_src scheme
;; Fermats Theorem applied

(define (expmod base exp m)
  (cond ((= exp 0)
         1)
        ((even? exp)
         (remainder (square (expmod base (/ exp 2) m)) m))
        (else
          (remainder (* base (expmod base (- exp 1)m))m))))
#+end_src

This procedure grows logarithmic in accordance to size of input. Using
it we can implement the Fermat test.

#+begin_src scheme
(define (fermat-test n)
  (define (try-it a)
    (= (expmod a n n) a))
  (try-it (+ 1 (random (- n 1)))))
#+end_src

The final form. Will take a number and number of attempts to see if it
is prime.

#+begin_src scheme
(define (fast-prime? n times)
  (cond ((= times 0) 1)
        ((fermat-test n) (fast-prime? n (- times 1))) (else 0)
#+end_src

However, it has been proven that even if the procedure says that a
number passes the test then it does not mean that it is prime. There is
also the fact that some non primes that fool the Fermat test for why
modulo congruent with a lot of numbers. This algorithm is an example of
a =Probabilistic Algorithm= in which there is a chance of error that the
algorithm yields the incorrect result.

