org/01procedures.org
** Formulating Abstractions with Higher Order Procedures 1.3
:PROPERTIES:
:CUSTOM_ID: formulating-abstractions-with-higher-order-procedures-1.3
:END:
The ability to write procedures and function allows for the ability to
create program that can work on higher and higher levels of abstraction
and reuse instructions and operations without repeat the definitions.

Procedures that only work on numbers can be limiting. =Higher Order=
procedures are those that accept functions as arguments and can return
functions as results.

** 1.3.1 Procedures as Argument

Here we have three procedures.

#+begin_src scheme
;; Sums Integers from A to B
(define (sum-integers a b)
        (if (> a b)
            0
            (+ a (sum-integers (+ a 1) b))))

;; Computers Sum of Cubes of Integers
(define (sum-cubes a b)
    (if (> a b)
        0
        (+ (cube a) (sum-cubes (+ a 1) b))))

;; Computes Series of multiplied cubes
;;; 1 / (1 * 3) + 1 / (5 * 7) +1 / (9 * 11)
(define (pi-sum a b)
    (if (> a b)
        0
        (+ (/ 1.0 (* a (+ a 2))) (pi-sum (+ a 4) b))))

(define (cube x) (* x x x))
#+end_src

These are similar procedures, that have the same template and could be
automatically generated. Sigma notation is used in order to express how
express a method to add the results of a function given a range of
integer values.

\begin{equation}
\sum_{n=a}^{b}(f(n) = f(a)+...+f(b))
\end{equation}

The realization that the pattern being emulated is in fact a
mathematical summation allows for easy redefinition using the scheme
language.

#+begin_src scheme
(define (sum term a next b)
        (if (> a b)
            0
            (+ (term a)
                (sum term (next a) next b))))

;; term is a function that determines the selection of items being summed
;; next is a function that determines which is the next items after the previus one
    ;; for function term
#+end_src

Using some other helper functions it is possible to redefine all the
functions.

#+begin_src scheme
;; redefinition of a previous function
(define (sum-cubex a b)
        (sum cube a inc b))

(define (sum-integers a b)
        (sum identity a inc b))

(define (pi-sum a b)
        (define (pi-term x)
                (/ 1.0 (* x (+ x 2))))
        (define (pi-next x)
                (+ x 4))
        (sum pi-term a pi-next b))
#+end_src

Using this same higher order procecure it is possible to define a
function to approximate the integral of a function.

#+begin_src scheme

(define (integral f a b dx)
        (define (add-dx x)
                (+ x dx))
        (* (sum f (+ a (/ dx 2.0)) add-dx b)
            dx))
;; can be used to approximate the integral from 0 to 1 of x^3
(integral cube 0 1 0.01)
;; .24998750000000042 result
(integral cube 0 1 0.001)
;; .249999875000001 result
#+end_src

** 1.3.2 Constructing Procedures Using Lambda

Scheme allows for methods of defining simple single use functions
without giving them names. These are =lambda=, anonymous function that
are a definition of a function that does one simple thing and developer
forgets about them.

#+begin_src scheme
(lambda (x) (+ x 4))
;; Format
(lambda (<name> <formal-parameters>) <body>)
#+end_src

Usually these are passed to other functions in order to generate higher
level procedures and are the hallmark of a functional programming
language. An example using previous mentions.

#+begin_src scheme
(define (pi-sum a b)
  (sum (lambda (x) (/ 1.0 (* x (+ x 2))))
       a
       (lambda (x) (+ x 4))
       b))

(define (integral f a b dx)
  (* (sum f
          (+ a (/ dx 2.0))
          (lambda (x) (+ x dx))
          b)
     dx))
#+end_src

The usualy method for defining named function can be thought of as
syntactic sugar for lambda.

#+begin_src scheme
(define (f x) (+ x 1)) ;; is the same as
(define f (lambda (x) (+ x 1)))
#+end_src

*** Using =let= to create local variables
:PROPERTIES:
:CUSTOM_ID: using-let-to-create-local-variables
:END:
Using the =let= keyword is useful in defining variables with limited
scope in order to pollute namespace. Taking the mathematical expression

\begin{equation}
f(x, y) = x(1 + (x * y))^2 + 1 y (1 - y) + ( 1 + (x * y))(1 - y)
\end{equation}

can be simplified to

\begin{equation}
a = 1 + (x * y),
b = 1 - y,
f(x, y) = xa^2 + (y * b) + ab
\end{equation}

Writing scheme code in order to emulate this function would require not
only the parameters but also defining the local variables a and b. Here
is some normal scheme code.

#+begin_src scheme
(define (f x y)
        (define (f-helper a b)
                (+ (* x (square a))
                   (* y b)
                   (* a b)))
        (f-helper (+ 1(* x y))
                  (- 1 y)))
#+end_src

Here is the simplification. Side note, getting the indentation correct
was a pain in the ass.

#+begin_src scheme
(define (f x y)
    (let ((a (+ 1 (* x y)))
          (b (- 1 y)))

         (+ (* x (square a))
            (* y b)
            (* a b))))
#+end_src

General form for let expression is this

#+begin_example
(let ((<var1> <exp1>)
      (<var2> <exp2>)
      ...
      (<varn> <expn>))
    <body>)
#+end_example

Each section can be thought of as its own little mini section with
define pairs. The different is that the variables here have limited
scope and exist only within the confines of the S expression of let.
Even this expression can be thought of as syntactic sugar for a lambda
expression that take in certain parameters that are the names of
parameters and outputs a list with each item being corresponding to the
value of expression.

If a variable already has a value, then the =let= expression overrides
it within the scope of the expression, ignoring outside values.

#+begin_src scheme
(define x 5)
(+ (let ((x 3))
        (+ x (* x 10)))
   x) ;; evaluates to 38
#+end_src

Best practices dictates to use =let= in defining variables and =define=
in defining internal procedures.

** 1.3.3 Procedures as General Methods

Strategies have been introduced that allow for expression numerical
methods as scheme procedures, and abstracting away general strategies to
be independent of numbers and or even computation involved.

*** Example: Finding Roots of Equations by Half Interval Methods

Half interval method involved in finding roots of function which average
in range of values is found and if prove that a zero exists in interval,
the interval is cut in half until the root is found.

The number of steps required to find the root grows logarithmic in
relation to size of starting interval. Here is example from book.

#+begin_src scheme
(define (search f neg-point pos-point)
  (let ((midpoint (average neg-point pos-point)))
        
       (if (close-enough? neg-point pos-point)
           midpoint
           (let ((test-value (f midpoint)))
                (cond ((positive? test-value)
                       (search f neg-point mid-point))
                      ((negative? test-value)
                       (search f midpoint pos-point))
                      (else midpoint))))))
#+end_src

What this code does is first calculate the midpoint of the interval.
Then it checks to see if the interval is close enough, if it is, it
returns the midpoint. If not, then it evaluates the function f at the
midpoint. If this new value is positive then it calls itself with new
interval from beginning to midpoint. Then if negative the new range is
from midpoint to end of range. If the midpoint evaluates to zero then it
gets returned.

Search should not be called directly and instead suitable interval
should first be found and then =search= should be called.

