org/01procedures.tex

\subsection{Formulating Abstractions with Higher Order Procedures 1.3}
\label{sec:orgec1fa23}
The ability to write procedures and function allows for the ability to
create program that can work on higher and higher levels of abstraction
and reuse instructions and operations without repeat the definitions.

Procedures that only work on numbers can be limiting. \texttt{Higher Order}
procedures are those that accept functions as arguments and can return
functions as results.

\subsection{1.3.1 Procedures as Argument}
\label{sec:orgd5a7624}
Here we have three procedures.

\begin{verbatim}
;; Sums Integers from A to B
(define (sum-integers a b)
        (if (> a b)
            0
            (+ a (sum-integers (+ a 1) b))))

;; Computers Sum of Cubes of Integers
(define (sum-cubes a b)
    (if (> a b)
        0
        (+ (cube a) (sum-cubes (+ a 1) b))))

;; Computes Series of multiplied cubes
;;; 1 / (1 * 3) + 1 / (5 * 7) +1 / (9 * 11)
(define (pi-sum a b)
    (if (> a b)
        0
        (+ (/ 1.0 (* a (+ a 2))) (pi-sum (+ a 4) b))))
\end{verbatim}

These are similar procedures, that have the same template and could be
automatically generated. Sigma notation is used in order to express how
express a method to add the results of a function given a range of
integer values.

\begin{equation}
\sum_{n=a}^{b}(f(n) = f(a)+...+f(b))
\end{equation}

The realization that the pattern being emulated is in fact a
mathematical summation allows for easy redefinition using the scheme
language.

\begin{verbatim}
(define (sum term a next b)
        (if (> a b)
            0
            (+ (term a)
                (sum term (next a) next b))))

;; term is a function that determines the selection of items being summed
;; next is a function that determines which is the next items after the previus one
    ;; for function term
\end{verbatim}

Using some other helper functions it is possible to redefine all the
functions.

\begin{verbatim}
;; redefinition of a previous function
(define (sum-cubex a b)
        (sum cube a inc b))

(define (sum-integers a b)
        (sum identity a inc b))

(define (pi-sum a b)
        (define (pi-term x)
                (/ 1.0 (* x (+ x 2))))
        (define (pi-next x)
                (+ x 4))
        (sum pi-term a pi-next b))
\end{verbatim}

Using this same higher order procecure it is possible to define a
function to approximate the integral of a function.

\begin{verbatim}
(define (integral f a b dx)
        (define (add-dx x)
                (+ x dx))
        (* (sum f (+ a (/ dx 2.0)) add-dx b)
            dx))
;; can be used to approximate the integral from 0 to 1 of x^3
(integral cube 0 1 0.01)
;; .24998750000000042 result
(integral cube 0 1 0.001)
;; .249999875000001 result
\end{verbatim}

\subsection{1.3.2 Constructing Procedures Using Lambda}
\label{sec:orge0b7f2d}
Scheme allows for methods of defining simple single use functions
without giving them names. These are \texttt{lambda}, anonymous function that
are a definition of a function that does one simple thing and developer
forgets about them.

\begin{verbatim}
(lambda (x) (+ x 4))
;; Format
(lambda (<name> <formal-parameters>) <body>)
\end{verbatim}

Usually these are passed to other functions in order to generate higher
level procedures and are the hallmark of a functional programming
language. An example using previous mentions.

\begin{verbatim}
(define (pi-sum a b)
        (sum (lambda (x) (/ 1.0 (* x (+ x 2))))
            a
            (lambda (x) (+ x 4))
            b))

(define (integral f a b dx)
        (* (sum f
                (+ a (/ dx 2.0))
                (lambda (x) (+ x dx))
                b)
            dx))
\end{verbatim}

The usualy method for defining named function can be thought of as
syntactic sugar for lambda.

\begin{verbatim}
(define (f x) (+ x 1)) ;; is the same as
(define f (lambda (x) (+ x 1)))
\end{verbatim}

\subsubsection{Using \texttt{let} to create local variables}
\label{sec:orgda032b8}
Using the \texttt{let} keyword is useful in defining variables with limited
scope in order to pollute namespace. Taking the mathematical expression

\begin{equation}
f(x, y) = x(1 + (x * y))^2 + 1 y (1 - y) + ( 1 + (x * y))(1 - y)
\end{equation}

can be simplified to

\begin{equation}
a = 1 + (x * y),
b = 1 - y,
f(x, y) = xa^2 + (y * b) + ab
\end{equation}

Writing scheme code in order to emulate this function would require not
only the parameters but also defining the local variables a and b. Here
is some normal scheme code.

\begin{verbatim}
(define (f x y)
        (define (f-helper a b)
                (+ (* x (square a))
                   (* y b)
                   (* a b)))
        (f-helper (+ 1(* x y))
                  (- 1 y)))
\end{verbatim}

Here is the simplification. Side note, getting the indentation correct
was a pain in the ass.

\begin{verbatim}
(define (f x y)
    (let ((a (+ 1 (* x y)))
          (b (- 1 y)))

         (+ (* x (square a))
            (* y b)
            (* a b))))
\end{verbatim}

General form for let expression is this

\begin{verbatim}
(let ((<var1> <exp1>)
      (<var2> <exp2>)
      ...
      (<varn> <expn>))
    <body>)
\end{verbatim}

Each section can be thought of as its own little mini section with
define pairs. The different is that the variables here have limited
scope and exist only within the confines of the S expression of let.
Even this expression can be thought of as syntactic sugar for a lambda
expression that take in certain parameters that are the names of
parameters and outputs a list with each item being corresponding to the
value of expression.

If a variable already has a value, then the \texttt{let} expression overrides
it within the scope of the expression, ignoring outside values.

\begin{verbatim}
(define x 5)
(+ (let ((x 3))
        (+ x (* x 10)))
   x) ;; evaluates to 38
\end{verbatim}

Best practices dictates to use \texttt{let} in defining variables and \texttt{define}
in defining internal procedures.

\subsection{1.3.3 Procedures as General Methods}
\label{sec:orgf1e6e5c}
Strategies have been introduced that allow for expression numerical
methods as scheme procedures, and abstracting away general strategies to
be independent of numbers and or even computation involved.

\subsubsection{Finding Roots of Equations by Half Interval Methods}
\label{sec:org626f73e}
Half interval method involved in finding roots of function which average
in range of values is found and if prove that a zero exists in interval,
the interval is cut in half until the root is found.

The number of steps required to find the root grows logarithmic in
relation to size of starting interval. Here is example from book.

\begin{verbatim}
(define (search f neg-point pos-point)
  (let ((midpoint (average neg-point pos-point)))

       (if (close-enough? neg-point pos-point)
           midpoint
           (let ((test-value (f midpoint)))
                (cond ((positive? test-value)
                       (search f neg-point mid-point))
                      ((negative? test-value)
                       (search f midpoint pos-point))
                      (else midpoint))))))
\end{verbatim}

What this code does is first calculated the midpoint of the interval.
Then it checks to see if the interval is close enough, if it is, it
returns the midpoint. If not, then it evaluates the function f at the
midpoint. If this new value is positive then it calls itself with new
interval from beginning to midpoint. Then if negative the new range is
from midpoint to end of range. If the midpoint evaluates to zero then it
gets returned.

Search should not be called directly and instead suitable interval
should first be found and then \texttt{search} should be called.
