org/01procedures.tex

\subsubsection{Fixed Points of Functions}
\label{sec:org9499a2b}
Fixed point in function are where the output of a function is the same
as the input. These points can be found by applying this calculation.
Where x is a guess and applying the same transformation.

\begin{equation}
f(x), f(f(x)), f(f(f(x))), f(f(f(f(x))))
\end{equation}

Using this definition it is possible to define procedure that finds a
fixed point given a function and initial guess. Here is the example the
book gives.

\begin{verbatim}
(define tolerance 0.00001)

(define (close-enough? x y)
  (< (abs (- x y)) tolerance))
(define (fixed-point f first-guess)
  (define (try guess)
    (let ((next (f guess)))
         (if (close-enough? guess next)
             next
             (try next))))
  (try first-guess))

(fixed-point cos 1.0)
\end{verbatim}

This code basically just guesses the fixed point until it gets it close
enough based on some criteria.

It can also find the solution to equations. Give for example.

\begin{equation}
y = cos(y) + sin(y)
\end{equation}

Can be solved with.

\begin{verbatim}
(fixed-point (lambda (x) (+ (sin x) (cos x))) 1.0)
\end{verbatim}

Average Damping can also be used in order to more carefully converged
towards the wanted value without getting stuck in an infinite loop.

\subsection{1.3.4 Procedures as Returned Values}
\label{sec:org58486ce}
More power and expression ability can be achieved by using procedures
that generate and return procedures. For example, procedure can be
defined that can average damp the result of a function.

\begin{verbatim}
(define (average-damp f)
  (lambda (x) (average x (f x))))
\end{verbatim}

What this function does is it take a function and return a new function
that takes the average of an input and the result of calling that
function on an input. This concept can be used in order to redefine the
square root function in terms of the previously define \texttt{fixed-point}
function.

\begin{verbatim}
(define (sqrt x)
  (fixed-point (average-damp (lambda (y) (/ x y))) 1.0))

;; Cube Root can also be defined
\end{verbatim}

Recognizing patterns that repeat in procedures is an important skill to
have as it for more easy reuse of different components.

\subsubsection{Newton's Method}
\label{sec:org3343891}
Early implementation of square root function involved Newton's method in
which solution can be approximated using the identity.

\begin{equation}
f(x) = x - \frac{g(x)}{Dg(x)}
\end{equation}

The does here is to find \emph{x} such that f(x) = 0. The bottom term is the
derivative of the function \emph{g} at \emph{x}. This method does not always
converge but does converge enough times such that it is useful
approximation.

In order to use this method, the derivative must found, and used. It is
defined as

\begin{equation}
g'(x) = \frac{g(x + dx) - g(x)}{dx}
\end{equation}

The code here is simply returning a new function that is in terms of the
passed and uses the definition of the derivative in order to calculate
the derivative at a certain value of \emph{x}.

\begin{verbatim}
(define dx 0.000001)
(define (deriv g)
  (lambda (x) 
        (/ (- (g (+ x dx))
              (g x))
           dx)))
\end{verbatim}

A new procedure can be defined that take a function \emph{f} and returns it's
derivative in terms of \emph{f}. Then Newton's Method can be implemented by
using it as a fixed point function.

\begin{verbatim}
(define (newton-transform g)
  (lambda (x)
          (- (/ (g x)
                ((derive g) x)))))

(define (newtons-method g guess)
  (fixed-point (newton-transform g) guess))
\end{verbatim}

The square root function can be redefined in terms of these new
functions.

\subsubsection{Abstractions and First Class Procedures}
\label{sec:org9f58054}
Further abstraction can be achieved by formulating the repeat used of
the fixed point function and abstracting its repeated use.

\begin{verbatim}
(define (fixed-point-of-transform g transform guess)
  (fixed-point (transform g) guess))
\end{verbatim}

This procedure takes as arguments function g, a function that a solution
found, and an initial guess. What is does is it calls the fixed point
function that takes the transform procedure and calls it on g, and the
guess. The whole purpose is to define a function that can be solved and
to solve it. And this can be used to redefine the square root function.

\begin{verbatim}
(define (sqrt x)
  (fixed-point-of-transform (lambda (y) (/ x y))
                            average-damp
                            1.0))
\end{verbatim}

These higher order procedures allow for easy expression of computing
methods using more basic elements that already been defined in our code.
Overly abstraction code can also de detrimental but the price of not
doing so is worse. The key is thinking in terms of abstraction and
reusing them whenever code begins to feel repetitive and to apply them
and new contexts.

In computer languages there is a concept of first-class elements. These
have properties in computer languages in which there are few
restrictions and have some features.

\begin{itemize}
\item Can be named as variables
\item passed as arguments to functions
\item returned as result of procedures
\item include in data structure
\end{itemize}

In lisp and other dialects function are first class citizens, with all
the above features. Fast and efficient implementation is difficult, but
expression are very powerful.
\end{document}